stressTest/mypage.yaml
config:
  target: http://localhost:3003
  phases:
    - duration: 30
      arrivalRate: 10
  defaults:
    headers:
      User-Agent: Artillery
  payload:
    skipHeader: true
    path: "../data/user.csv"
    fields:
      - companyId
      - userId
      - password
      - teamId

scenarios:
  - name: "마이페이지 조회"
    flow:
      - post:
          url: "/auth/user"
          json:
            companyId: "{{companyId}}"
            userId: "{{userId}}"
            password: "{{password}}"
          capture:
            json: "$.token"
            as: "token"
      - get:
          url: "/myfiles"
          qs:
            pageNum: 1
            pageSize: 5
          headers:
            authorization: "{{token}}"
      - get:
          url: "/meetingfiles"
          qs:
            pageNum: 1
            pageSize: 5
          headers:
            authorization: "{{token}}"
      - get:
          url: "/reportfiles"
          qs:
            pageNum: 1
            pageSize: 5
          headers:
            authorization: "{{token}}"