stressTest/user.yaml
-- Active: 1678195960353@@express-database.cczpvl46r6wt.ap-northeast-2.rds.amazonaws.com@3306@final_project_database
config:
  target: http://localhost:3003
  phases:
    - duration: 60
      arrivalRate: 30
  defaults:
    headers:
      User-Agent: Artillery
  payload:
    skipHeader: true
    path: "../data/user.csv"
    fields:
      - companyId
      - userId
      - password
      - teamId

scenarios:
  - name: "일반 유저 로그인후 달력조회"
    flow:
      - post:
          headers:
            Content-Type: application/json
          url: "/auth/user"
          json:
            companyId: "{{companyId}}"
            userId: "{{userId}}"
            password: "{{password}}"
          capture:
            json: "$.token"
            as: "token"
      - get: 
          url: "/totalSchedule/{{teamId}}"
          qs:
            year: 2023
            month: 4
          headers:
            authorization: "{{token}}"